In [2]:
import pandas as pd

In [3]:
# 2 main datatypes
# One is series which is of 1 dimensional and DataFrame of 2 dimension.
series = pd.Series(["BMW","ASHOK LEYLAND","TATA"])

In [4]:
series

0              BMW
1    ASHOK LEYLAND
2             TATA
dtype: object

In [5]:
colours = pd.Series(["Red","Blue","White"])
colours

0      Red
1     Blue
2    White
dtype: object

In [6]:
# DataFrame = 2-D
car_data = pd.DataFrame({"Car Make":series,"colour":colours})
car_data

        Car Make colour
0            BMW    Red
1  ASHOK LEYLAND   Blue
2           TATA  White

In [8]:
# Import data
car_sales = pd.read_csv("7.1 car-sales.csv")   
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
# Exporting datafreme ----> This is to export the file to the jupyter notebook homepage
car_sales.to_csv("exported-car-sales.csv")

In [12]:
exported = pd.read_csv("exported-car-sales.csv") 
exported

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

## Compare the 1 and 2 csv file
There is a change in data that it is showing Unnamed:0 ...
SO in order to export and import the file as it is we need to alter the code 
as below...

In [15]:
car_sales.to_csv("exported-car-sales.csv",index=False)

In [16]:
exported = pd.read_csv("exported-car-sales.csv") 
exported

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## DESCRIBE DATA

In [19]:
# Attributes
car_sales.dtypes # ----> This shows the data frame or data type of csv file\
# Functions
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [20]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [21]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [22]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [24]:
car_sales.describe() # ---> This gives the calculates statical value

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [25]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [32]:
car_sales.mean() #---> This gives the mean of the numericsl values

C:\Users\karth\AppData\Local\Temp\ipykernel_27492\902289730.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  car_sales.mean() #---> This gives the mean of the numericsl values

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [34]:
car_prices = pd.Series([300000,250000,600000]) # ---> Here we created int datatype and assigned it to car_prices
car_prices.mean()

383333.3333333333

In [35]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [36]:
#To get specific column sum we can use the following code
car_sales["Doors"].sum()

40

In [37]:
len(car_sales)

10